# YOLOv11n-seg with P2-P5 detection
nc: 1  # 单类别

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]     # 9
  - [-1, 2, C2PSA, [1024]]       # 10

head:
  # --- P2分支 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 1], 1, Concat, [1]]                   # 12 拼接P2
  - [-1, 2, C3k2, [128, False]]                 # 13

  # --- P3分支 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15 拼接P3
  - [-1, 2, C3k2, [256, False]]                 # 16

  # --- P4分支 ---
  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 13], 1, Concat, [1]]                  # 18
  - [-1, 2, C3k2, [512, False]]                 # 19

  # --- P5分支 ---
  - [-1, 1, Conv, [512, 3, 2]]                  # 20
  - [[-1, 10], 1, Concat, [1]]                  # 21
  - [-1, 2, C3k2, [1024, True]]                 # 22

  # --- 四尺度检测头 ---
  - [[13, 16, 19, 22], 1, Segment, [nc, 64, 256, 4]]